-------------------------------团队开发须知-----------------------------
	
	

0、开发环境
            统一开发环境,myeclipse,adt,运行测试android4.1，避免意想不到的问题

一、例会制度:
每天早上一个会:讨论昨天完成情况,今天任务.方向,包括业务逻辑的讨论 8：30

二、注释及命名规范:
1.所有命名要遵循驼峰式
2.控件名称命名规范
	layout：以dl开头一级菜单已创建，二级菜单请改为dl_一级菜单名字_二级菜单名字
	drawable：以dd开头，后面跟上图片的放置处，如textview等，再跟上用途，若有重复，在放置处后面跟上layout的简单名字
 	不要以@+id的形式，请换为@id，然后在ids。xml中放进id的名字，我已经划分各个模块，如果有冲突协调商量

3.注释规范:
	①类要加注释,并且注明作者.时间
	②所有方法和属性要加注释,特别是接口和抽象类中的方法和属性
	③业务逻辑注释（可模仿老师，先把架子搭起来，写上注释，然后在写代码，这样思路比较清晰）
4.不允许出现中文命名,不知道问有道(我们是有经验的开发人员)
	
	

三、SVN操作规范:
①一个小模块写完,必须测试通过,(如果无法测试的功能,应确保无误) 再提交,
	提交时注意:--在群里发个消息(完成什么模块或功能,现在提交代码)
		    这样可以减少冲突
		 --先与资源库同步,看当前资源库的状态，再进行相应操作
②解决复杂冲突时,应与对方面对面沟通,(很重要)，会减少很多麻烦
③提交代码时,bin、gen文件不需要提交（ignore）
④不要随意操作SVN中文件

四、笔记规范:
项目下有个doc文件夹,每个组员必须每天做好笔记,内容包括:
	①昨天任务完成情况
	②没有解决的问题
	③今天任务
	④记录当天所做的功能，以及遇到的问题

五、其他
	①多沟通
	②当修改别人的代码的时候一定要飞Q一下，以减少冲突
	③团队气氛调动
	④类名注释
	Window->preferences->java->code style ->code templates ->Comments ->typese->edit->
		/**
		 * @Description ${todo}
		 * @author Andy
		 * @date ${date} ${time}
		 * ${tags}
		 */
	⑤统一编码UTF-8
	
	在写layout时，要多用style，这样可以大大节省时间
	
	打Log的时候不要直接用Log，用util中的Logger